export const region_pref = [
  {
    region: "北海道",
    prefs: ["北海"],
  },
  {
    region: "東北",
    prefs: ["青森", "岩手", "秋田", "宮城", "山形", "福島"],
  },
  {
    region: "関東",
    prefs: ["茨城", "栃木", "群馬", "埼玉", "千葉", "東京", "神奈川"],
  },
  {
    region: "中部",
    prefs: [
      "新潟",
      "富山",
      "石川",
      "福井",
      "山梨",
      "長野",
      "岐阜",
      "静岡",
      "愛知",
    ],
  },
  {
    region: "近畿",
    prefs: ["三重", "滋賀", "京都", "大阪", "兵庫", "奈良", "和歌山"],
  },
  {
    region: "中国",
    prefs: ["鳥取", "島根", "岡山", "広島", "山口"],
  },
  {
    region: "四国",
    prefs: ["徳島", "香川", "愛媛", "高知"],
  },
  {
    region: "九州",
    prefs: ["福岡", "佐賀", "長崎", "熊本", "大分", "宮崎", "鹿児島"],
  },
  {
    region: "沖縄",
    prefs: ["沖縄"],
  },
];
