import data from "./color.json";

export const region_pref = [
  {
    region: "北海道地方",
    prefs: ["北海道"],
  },
  {
    region: "東北地方",
    prefs: [
      "青森県",
      "岩手県",
      "秋田県",
      "宮城県",
      "山形県",
      "福島県",
    ],
  },
  {
    region: "関東地方",
    prefs: [
      "茨城県",
      "栃木県",
      "群馬県",
      "埼玉県",
      "千葉県",
      "東京都",
      "神奈川県",
    ],
  },
  {
    region: "中部地方",
    prefs: [
      "新潟県",
      "富山県",
      "石川県",
      "福井県",
      "山梨県",
      "長野県",
      "岐阜県",
      "静岡県",
      "愛知県",
    ],
  },
  {
    region: "近畿地方",
    prefs: [
      "三重県",
      "滋賀県",
      "京都府",
      "大阪府",
      "兵庫県",
      "奈良県",
      "和歌山県",
    ],
  },
  {
    region: "中国地方",
    prefs: ["鳥取県", "島根県", "岡山県", "広島県", "山口県"],
  },
  {
    region: "四国地方",
    prefs: ["徳島県", "香川県", "愛媛県", "高知県"],
  },
  {
    region: "九州地方",
    prefs: [
      "福岡県",
      "佐賀県",
      "長崎県",
      "熊本県",
      "大分県",
      "宮崎県",
      "鹿児島県",
    ],
  },
  {
    region: "沖縄地方",
    prefs: ["沖縄県"],
  },
];

export const prefColors = data;
